{
  "plugins.plugins": "PLUGINS",
  "plugins.everything": "EVERYTHING IS A PLUGIN",
  "plugins.text1": "In Remix, everything is a plugin. Core plugins are preloaded for essential operations. Additional plugins offer an expanded palette of tools.",
  "plugins.text2": "The Remix team builds all core plugins and some additional plugins, all of which are designated by the green checkmark. We also support teams who build plugins to allow their projects to be used inside of Remix.",
  "plugins.core": "Core Plugins",
  "plugins.solidityCompiler": "Solidity Compiler",
  "plugins.text3": "Compiles Solidity and YUL contracts. Accesses compilation details. Publishes compiled contract and metadata to IPFS or Swarm.",
  "plugins.deployRun": "Deploy & Run",
  "plugins.text4": "Deploys contracts to the in-browser chain (Remix VM), local nodes, or public networks. Accesses and interacts with deployed contracts. Records and plays back transactions.",
  "plugins.fileExplorer": "File Explorer",
  "plugins.text5": "Organizes files in Workspaces and folders, clones Git repos, uploads files, creates GISTs, flattens files and more.",
  "plugins.debugger": "Debugger",
  "plugins.text6": "A visual debugger that includes breakpoints and a stepper. Checks high and low level parameters, and fetches and debugs transactions of verified contracts.",
  "plugins.solidityAnalyzers": "Solidity Analyzers",
  "plugins.text7": "Examines and debugs code without actually executing it. Integrates with Slither.",
  "plugins.solidityUnitTesting": "Solidity Unit Testing",
  "plugins.text8": "Runs unit tests written in Solidity.",
  "plugins.text9": "An npm package run locally to connect a folder on your filesystem to the Remix website.",
  "plugins.viewAll": "View All",
  "plugins.text10": "Explore all our core plugins on GitHub",
  "plugins.additional": "Additional Plugins",
  "plugins.maintainedBy": "Maintained by Remix",
  "plugins.text11": "Verifies and fetches verified contracts.",
  "plugins.verified": "Verified",
  "plugins.text12": "Verifies contracts on Etherscan.",
  "plugins.text13": "Verifies contracts on Tenderly. Imports Tenderly projects into Remix.",
  "plugins.text14": "Flattens compiled contracts.",
  "plugins.gasProfiler": "Gas Profiler",
  "plugins.text15": "Displays the gas costs for every transaction executed. Displays total execution costs and per line costs.",
  "plugins.text16": "Tutorials about Solidity and Remix features, with quizzes to check progress.",
  "plugins.text17": "A toolbox for zkSNARKs on Ethereum.",
  "plugins.text18": "Compiles contracts written in Cairo, and deploys to Starknet chains.",
  "plugins.text19": "Gives contracts the same address when deploying to different chains.",
  "plugins.text20": "Explore documentation for all our additional plugins.",
  "plugins.engine": "Remix Plugin Engine",
  "plugins.text21": "The Remix Plugin Engine manages the communication between plugins. Plugin developers should start <a> here</a>. Remix plugins use bootstrap and should abide by our UI Standards.",
  "plugins.text22": "Any project that wants to use our plugins can implement the Remix Plugin Engine. See our example project <a1> here</a1>. Currently the Remix Plugin Engine is used in the <a2> Remix IDE</a2> and the <a3> Remix VSCode</a3> extension.",
  "plugins.documentation": "Documentation"
}
