{
  "plugins.plugins": "Plugins",
  "plugins.everything": "Tout est un plugin",
  "plugins.text1": "Dans Remix, tout est un plugin. Les plugins principaux sont préchargés pour les principales opérations. Des plugins supplémentaires offrent une palette élargie d'outils.",
  "plugins.text2": "L'équipe Remix construit tous les plugins principaux et certains plugins supplémentaires, qui sont tous désignés par la coche verte. Nous soutenons également les équipes qui développent des plugins pour permettre à leurs projets d'être utilisés dans Remix.",
  "plugins.core": "Plugins Principaux",
  "plugins.solidityCompiler": "Compilateur Solidity",
  "plugins.text3": "Compile les contrats Solidity et YUL. Accède aux détails de compilation. Publie les contrats compilés et les métadonnées sur IPFS ou Swarm.",
  "plugins.deployRun": "Déployer & Exécuter",
  "plugins.text4": "Déploie des contrats sur la chaîne en navigateur (Remix VM), nœuds locaux, ou réseaux publics. Accède et interagit avec des contrats déployés. Enregistre et rejoue des transactions.",
  "plugins.fileExplorer": "Explorateur de Fichiers",
  "plugins.text5": "Organise des fichiers dans des espaces de travail et des dossiers, clone des dépôts Git, télécharge des fichiers, crée des GIST, aplatit des fichiers et plus encore.",
  "plugins.debugger": "Débogueur",
  "plugins.text6": "Un débogueur visuel qui inclut des points d'arrêt et un pas à pas. Vérifie les paramètres de haut et de bas niveau, et récupère et débogue les transactions des contrats vérifiés.",
  "plugins.solidityAnalyzers": "Analyseurs Solidity",
  "plugins.text7": "Examine et débogue le code sans l'exécuter réellement. S'intègre avec Slither.",
  "plugins.solidityUnitTesting": "Test unitaire Solidity",
  "plugins.text8": "Exécute des tests unitaires écrits en Solidity.",
  "plugins.text9": "Un package npm exécuté localement pour connecter un dossier sur votre système de fichiers au site web Remix.",
  "plugins.viewAll": "Voir tout",
  "plugins.text10": "Explorez tous nos plugins principaux sur GitHub",
  "plugins.additional": "Plugins supplémentaires",
  "plugins.maintainedBy": "Maintenu par Remix",
  "plugins.text11": "Vérifie et récupère les contrats vérifiés.",
  "plugins.verified": "Vérifié",
  "plugins.text12": "Vérifie les contrats sur Etherscan.",
  "plugins.text13": "Vérifie les contrats sur Tenderly. Importe les projets Tenderly dans Remix.",
  "plugins.text14": "Aplatit les contrats compilés.",
  "plugins.gasProfiler": "Profileur de gaz",
  "plugins.text15": "Affiche les coûts en gaz pour chaque transaction exécutée. Affiche les coûts totaux d'exécution et les coûts par ligne.",
  "plugins.text16": "Tutoriels sur les fonctionnalités de Solidity et Remix, avec des quiz pour vérifier les progrès.",
  "plugins.text17": "Une boîte à outils pour zkSNARKs sur Ethereum.",
  "plugins.text18": "Compile les contrats écrits en Cairo, et procède au déploiement sur les chaînes Starknet.",
  "plugins.text19": "Donne aux contrats la même adresse lors du déploiement sur des chaînes différentes.",
  "plugins.text20": "Explorez la documentation pour tous nos plugins supplémentaires.",
  "plugins.engine": "Moteur de Plugin Remix",
  "plugins.text21": "Le moteur de plugin Remix gère la communication entre les plugins. Les développeurs de plugins doivent commencer <a>ici</a>. Les plugins Remix utilisent Boostrap et doivent respecter nos normes d'interface utilisateur.",
  "plugins.text22": "Tout projet qui souhaite utiliser nos plugins peut implémenter le moteur de plugin Remix. Voir notre projet type <a1> ici</a1>. Actuellement, le moteur de plugin Remix est utilisé dans le <a2> Remix IDE</a2> et l'extension <a3> Remix VSCode</a3>.",
  "plugins.documentation": "Documentation"
}
