{
  "plugins.plugins": "Plugin",
  "plugins.everything": "Tutto è un plugin",
  "plugins.text1": "In Remix, tutto è un plugin. I plugin base sono precaricati per le operazioni essenziali. I plugin aggiuntivi offrono un'ampia gamma di strumenti.",
  "plugins.text2": "Il team di Remix crea tutti i plugin principali e alcuni plugin aggiuntivi, tutti contrassegnati dal segno di spunta verde. Supportiamo anche i team che creano plugin per consentire l'uso dei propri progetti all'interno di Remix.",
  "plugins.core": "Plugin base",
  "plugins.solidityCompiler": "Compilatore Solidity",
  "plugins.text3": "Compila i contratti Solidity e YUL. Accede ai dettagli della compilazione. Pubblica il contratto compilato e i metadati su IPFS o Swarm.",
  "plugins.deployRun": "Distribuisci ed esegui",
  "plugins.text4": "Distribuisce i contratti nella catena in-browser (Remix VM), nei nodi locali o nelle reti pubbliche. Accede e interagisce con i contratti distribuiti. Registra e riproduce le transazioni.",
  "plugins.fileExplorer": "Esplora file",
  "plugins.text5": "Organizza i file in spazi di lavoro e cartelle, clona i repository Git, carica i file, crea GIST, esegue il flatterning dei file e altro ancora.",
  "plugins.debugger": "Debugger",
  "plugins.text6": "Un debugger visivo che include punti di interruzione e uno stepper. Controlla i parametri di alto e basso livello, recupera ed esegue il debug delle transazioni dei contratti verificati.",
  "plugins.solidityAnalyzers": "Analizzatori di Solidity",
  "plugins.text7": "Esamina ed esegue il debug del codice senza eseguirlo. Si integra con Slither.",
  "plugins.solidityUnitTesting": "Unit test di Solidity",
  "plugins.text8": "Esegue unit test scritti in Solidity.",
  "plugins.text9": "Un pacchetto npm eseguito localmente per collegare una cartella del proprio filesystem al sito web di Remix.",
  "plugins.viewAll": "Visualizza tutti",
  "plugins.text10": "Esplora tutti i nostri plugin base su GitHub",
  "plugins.additional": "Plugin aggiuntivi",
  "plugins.maintainedBy": "Mantenuto da Remix",
  "plugins.text11": "Verifica e recupera i contratti verificati.",
  "plugins.verified": "Verificato",
  "plugins.text12": "Verifica i contratti su Etherscan.",
  "plugins.text13": "Verifica i contratti su Tenderly. Importa i progetti Tenderly in Remix.",
  "plugins.text14": "Esegue il flattening dei contratti compilati.",
  "plugins.gasProfiler": "Profilatore di gas",
  "plugins.text15": "Visualizza i costi del gas per ogni transazione eseguita. Visualizza i costi totali di esecuzione e i costi per riga.",
  "plugins.text16": "Tutorial sulle funzioni di Solidity e Remix, con quiz per verificare i progressi.",
  "plugins.text17": "Un toolbox per gli zkSNARK su Ethereum.",
  "plugins.text18": "Compila i contratti scritti in Cairo e li distribuisce alle catene Starknet.",
  "plugins.text19": "Attribuisce ai contratti lo stesso indirizzo quando vengono distribuiti su catene diverse.",
  "plugins.text20": "Esplora la documentazione di tutti i nostri plugin aggiuntivi.",
  "plugins.engine": "Plugin Engine di Remix",
  "plugins.text21": "Il Plugin Engine di Remix gestisce la comunicazione tra i plugin. Gli sviluppatori di plugin dovrebbero iniziare <a> qui</a>. I plugin di Remix utilizzano bootstrap e devono rispettare i nostri standard per le UI.",
  "plugins.text22": "Qualsiasi progetto che voglia utilizzare i nostri plugin può implementare il Plugin Engine di Remix. Si veda il nostro progetto di esempio <a1> qui</a1>. Attualmente il Plugin Engine di Remix è utilizzato in <a2> Remix IDE</a2> e nell'estensione <a3> Remix VSCode</a3>.",
  "plugins.documentation": "Documentazione"
}
