{
  "plugins.plugins": "Plugins",
  "plugins.everything": "Todo es un plugin",
  "plugins.text1": "En Remix, todo es un plugin. Los plugins troncales se cargan previamente para operaciones esenciales. Los plugins adicionales ofrecen un abanico más extenso de herramientas.",
  "plugins.text2": "El equipo Remix construye todos los plugins troncales y algunos plugins adicionales, todos ellos señalados mediante un visto bueno verde. También apoyamos a equipos que construyen plugins para permitir que sus proyectos se utilicen dentro de Remix.",
  "plugins.core": "Plugins troncales",
  "plugins.solidityCompiler": "Compilador Solidity",
  "plugins.text3": "Compila contratos Solidity y YUL. Accede a detalles de la compilación. Publica el contrato compilado y metadatos en IPFS o Swarm.",
  "plugins.deployRun": "Desplegar y ejecutar",
  "plugins.text4": "Despliega contratos en la cadena dentro del navegador (MV Remix), nodos locales o redes públicas. Accede e interactúa con contratos desplegados. Graba y reproduce transacciones.",
  "plugins.fileExplorer": "Explorador de archivos",
  "plugins.text5": "Organiza los archivos en espacios de trabajo y carpetas, clona repositorios Git, crea GIST y aplana archivos, entre otras funciones.",
  "plugins.debugger": "Depurador",
  "plugins.text6": "Un depurador visual que incluye puntos de interrupción y un simulador. Comprueba los parámetros de alto y bajo nivel y obtiene y depura transacciones de contratos verificados.",
  "plugins.solidityAnalyzers": "Analizadores Solidity",
  "plugins.text7": "Examina y depura un código sin llegar a ejecutarlo. Se integra con Slither.",
  "plugins.solidityUnitTesting": "Pruebas de unidades Solidity",
  "plugins.text8": "Ejecuta pruebas de unidades en Solidity.",
  "plugins.text9": "Un paquete npm que se ejecuta localmente para conectar con una carpeta en su directorio de archivos al sitio web Remix.",
  "plugins.viewAll": "Ver todo",
  "plugins.text10": "Explorar todos nuestros plugins troncales en GitHub",
  "plugins.additional": "Plugins adicionales",
  "plugins.maintainedBy": "Mantenido por Remix",
  "plugins.text11": "Verifica y obtiene contratos verificados.",
  "plugins.verified": "Verificado",
  "plugins.text12": "Verifica contratos en Etherscan.",
  "plugins.text13": "Verifica contratos en Tenderly. Importa proyectos Tenderly en Remix.",
  "plugins.text14": "Aplana contratos compilados.",
  "plugins.gasProfiler": "Gas Profiler",
  "plugins.text15": "Muestra el coste del gas para cada transacción ejecutada. Muestra los costes totales de ejecución y los costes por línea.",
  "plugins.text16": "Tutoriales sobre las funciones Solidity y Remix, con cuestionarios para evaluar el progreso.",
  "plugins.text17": "Una caja de herramientas para zkSNARKs en Ethereum.",
  "plugins.text18": "Compila contratos escritos en El Cairo y despliega cadenas Starknet.",
  "plugins.text19": "Otorga la misma dirección a los contratos cuando se despliegan en diferentes cadenas.",
  "plugins.text20": "Explora la documentación para todos nuestros plugins adicionales.",
  "plugins.engine": "Remix Plugin Engine",
  "plugins.text21": "Remix Plugin Engine gestiona la comunicación entre plugins. Los desarrolladores de plugin deberían comenzar <a>aquí</a>. Los plugins de Remix utilizan un arranque y deberían regirse por nuestros estándares de interfaz de usuario.",
  "plugins.text22": "Cualquier proyecto que quiera utilizar nuestros plugins puede implementar el Remix Plugin Engine. Vea <a1> aquí</a1> nuestro proyecto de ejemplo. Actualmente, el Remix Plugin Engine se utiliza en las extensiones <a2> IDE Remix</a2> y en <a3> VSCode Remix</a3>.",
  "plugins.documentation": "Documentación"
}
