{
  "plugins.plugins": "Плагины",
  "plugins.everything": "Плагины повсюду",
  "plugins.text1": "В Remix плагины повсюду: основные предустановлены для выполнения наиболее важных операций, а дополнительные содержат расширенную палитру инструментов.",
  "plugins.text2": "Команда Remix создает все основные и некоторые дополнительные плагины, отмеченные зеленым флажком. Кроме того, мы поддерживаем команды, создающие плагины, чтобы их проекты могли использоваться в Remix.",
  "plugins.core": "Основные плагины",
  "plugins.solidityCompiler": "Компилятор Solidity",
  "plugins.text3": "Компилирует контракты Solidity и YUL. Предоставляет доступ к деталям компиляции. Публикует скомпилированный контракт и метаданные в IPFS или Swarm.",
  "plugins.deployRun": "Развертывание и запуск",
  "plugins.text4": "Развертывание контрактов в цепочке браузера (Remix VM), на локальных узлах или в публичных сетях. Доступ к развернутым контрактам и взаимодействие с ними. Запись и воспроизведение транзакций.",
  "plugins.fileExplorer": "Файловый менеджер",
  "plugins.text5": "Организует файлы в рабочих пространствах и папках, клонирует Git-репозитории, загружает файлы, создает GIST, сглаживает файлы и многое другое.",
  "plugins.debugger": "Отладчик",
  "plugins.text6": "Визуальный отладчик, который включает точки останова и степпер. Проверяет высоко- и низкоуровневые параметры, а также выполняет поиск и отладку транзакций проверенных контрактов.",
  "plugins.solidityAnalyzers": "Анализаторы Solidity",
  "plugins.text7": "Изучает и отлаживает код, не выполняя его на самом деле. Интегрируется со Slither.",
  "plugins.solidityUnitTesting": "Модульное тестирование Solidity",
  "plugins.text8": "Запускает модульные тесты, написанные в Solidity.",
  "plugins.text9": "Пакет npm, запускаемый локально для подключения папки в вашей файловой системе к сайту Remix.",
  "plugins.viewAll": "Просмотреть все",
  "plugins.text10": "Ознакомьтесь со всеми нашими основными плагинами на GitHub",
  "plugins.additional": "Дополнительные плагины",
  "plugins.maintainedBy": "Поддерживается Remix",
  "plugins.text11": "Проверяет и извлекает проверенные контракты.",
  "plugins.verified": "Подтверждено",
  "plugins.text12": "Проверяет контракты на Etherscan.",
  "plugins.text13": "Проверяет контракты на Tenderly. Импортирует проекты Tenderly в Remix.",
  "plugins.text14": "Сглаживает компилированные контракты.",
  "plugins.gasProfiler": "Gas Profiler",
  "plugins.text15": "Отображает стоимость газа для каждой выполненной транзакции. Отображает общие затраты на выполнение и затраты на каждую линию.",
  "plugins.text16": "Руководства по функциям Solidity и Remix с тестами для проверки прогресса.",
  "plugins.text17": "Инструментарий для zkSNARKs на Ethereum.",
  "plugins.text18": "Компилирует контракты, написанные в Cairo, и развертывает их в сети Starknet.",
  "plugins.text19": "Предоставляет контрактам один и тот же адрес при развертывании в разных цепочках.",
  "plugins.text20": "Изучите документацию по всем нашим дополнительным плагинам.",
  "plugins.engine": "Remix Plugin Engine",
  "plugins.text21": "Remix Plugin Engine управляет взаимодействием между плагинами. Разработчики плагинов могут присоединиться <a>здесь</a>. Плагины Remix используют bootstrap и должны придерживаться наших стандартов пользовательского интерфейса.",
  "plugins.text22": "Любой проект, который хочет использовать наши плагины, может внедрить Remix Plugin Engine. Смотрите наш пример проекта<a1> здесь</a1>. В настоящее время Remix Plugin Engine используется в <a2> интегрированной среде разработки Remix</a2> и расширении <a3> Remix VSCode</a3>.",
  "plugins.documentation": "Документация"
}
